# Pandas
As described at https://pandas.pydata.org 
> pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

## Resources
1. Ch 5-6 in Python for Data Analysis, 2nd Ed, Wes McKinney (UCalgary library and https://github.com/wesm/pydata-book)
2. Ch 3 in Python Data Science Handbook, Jake VanderPlas (Ucalgary library and https://github.com/jakevdp/PythonDataScienceHandbook)


Let's explore some of the features. 

First, import Pandas, and Numpy as a good companion.

In [80]:
import numpy as np
import pandas as pd

## Create pandas DataFrames

There are several ways to create Pandas DataFrames, most notably from reading a csv (comma separated values file). DataFrames are 'spreadsheets' in Python. We will often use `df` as a variable name for a DataFrame.

If data is not stored in a file, a DataFrame can be created from a dictionary of lists

```python
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)


```

where dictionary keys become column headers.

An alternative is to create from a numpy array and set column headers seperatly:

In [81]:
# From a numpy array
df = pd.DataFrame( np.arange(20).reshape(5,4), columns=['alpha', 'beta', 'gamma', 'delta'])
df

   alpha  beta  gamma  delta
0      0     1      2      3
1      4     5      6      7
2      8     9     10     11
3     12    13     14     15
4     16    17     18     19

In [82]:
# checking its type
type(df)

pandas.core.frame.DataFrame

## Indexing
Accessing data in Dataframes is done by rows and columns, either index or label based.

In [83]:
# select a column
df['alpha']

0     0
1     4
2     8
3    12
4    16
Name: alpha, dtype: int32

In [84]:
# select two columns
df[['alpha', 'gamma']]

   alpha  gamma
0      0      2
1      4      6
2      8     10
3     12     14
4     16     18

In [85]:
# select rows
df.iloc[:2]

   alpha  beta  gamma  delta
0      0     1      2      3
1      4     5      6      7

In [86]:
# select rows and columns
df.iloc[:2, :2]

   alpha  beta
0      0     1
1      4     5

In [87]:
# select rows and columns, mixed
df.loc[:2, ['alpha', 'beta']]

   alpha  beta
0      0     1
1      4     5
2      8     9

## DataFrame math
Similar to Numpy, DataFrames support direct math

In [88]:
# direct math
df2 = (9/5) * df + 32
df2

   alpha  beta  gamma  delta
0   32.0  33.8   35.6   37.4
1   39.2  41.0   42.8   44.6
2   46.4  48.2   50.0   51.8
3   53.6  55.4   57.2   59.0
4   60.8  62.6   64.4   66.2

In [89]:
# add two dataframes of same shape
df + df2

   alpha  beta  gamma  delta
0   32.0  34.8   37.6   40.4
1   43.2  46.0   48.8   51.6
2   54.4  57.2   60.0   62.8
3   65.6  68.4   71.2   74.0
4   76.8  79.6   82.4   85.2

In [90]:
# map a function to each column
f = lambda x: x.max() - x.min()  # map column x -> max of column - min of column
df.apply(f)

alpha    16
beta     16
gamma    16
delta    16
dtype: int64

## DataFrame manipulation
Adding and deleting columns, as well as changing entries is similar to Python dictionaries.

Note that most DataFrame methods do not change the DataFrame directly, but return a new DataFrame. It is always good to check how the method you are invoking behaves.

In [91]:
# add a column
df['epsilon'] = ['low', 'medium', 'low', 'high', 'high']
df

   alpha  beta  gamma  delta epsilon
0      0     1      2      3     low
1      4     5      6      7  medium
2      8     9     10     11     low
3     12    13     14     15    high
4     16    17     18     19    high

In [92]:
# What is the size?
df.shape

(5, 5)

In [93]:
# delete column
df_dropped = df.drop(columns=['gamma'])
df_dropped

   alpha  beta  delta epsilon
0      0     1      3     low
1      4     5      7  medium
2      8     9     11     low
3     12    13     15    high
4     16    17     19    high

In [94]:
# the original dataframe is unaffected
df

   alpha  beta  gamma  delta epsilon
0      0     1      2      3     low
1      4     5      6      7  medium
2      8     9     10     11     low
3     12    13     14     15    high
4     16    17     18     19    high

Let's create a copy and assign new values to the first column:

In [95]:
df_copy = df.copy()
df_copy['alpha'] = 20
print(df)
print(df_copy)

   alpha  beta  gamma  delta epsilon
0      0     1      2      3     low
1      4     5      6      7  medium
2      8     9     10     11     low
3     12    13     14     15    high
4     16    17     18     19    high
   alpha  beta  gamma  delta epsilon
0     20     1      2      3     low
1     20     5      6      7  medium
2     20     9     10     11     low
3     20    13     14     15    high
4     20    17     18     19    high

DataFrames can be sorted by column:

In [96]:
# sorting values
df.sort_values(by='epsilon')

   alpha  beta  gamma  delta epsilon
3     12    13     14     15    high
4     16    17     18     19    high
0      0     1      2      3     low
2      8     9     10     11     low
1      4     5      6      7  medium

## Load data from file

Most often data will come from somewhere, often csv files, and using `pd.read_csv()` will allow smooth creation of DataFrames.

Let's load that same heart-attack.csv that we used in Numpy before:

In [97]:
data = pd.read_csv('auto-mpg.data', delim_whitespace=True, header=None)
data.columns= [
    "mpg",
    "cylinders",
    "displacement",
    "weight",
    "acceleration",
    "model_year",
    "origin",
    "class",
    "car_name"
]

In [98]:
# Peek at the first rows
data.head()

,mpg,cylinders,displacement,weight,acceleration,model_year,origin,class,car_name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

After loading data, it is good practice to check what we have. Usually, the sequences is:
1. Check dimension
2. Peek at the first rows
3. Get info on data types and missing values
4. Summarize columns

In [99]:
# Check dimension (rows, columns) 
data.shape

(398, 9)

In [100]:
# Column names are
data.columns

Index(['mpg', 'cylinders', 'displacement', 'weight', 'acceleration',
       'model_year', 'origin', 'class', 'car_name'],
      dtype='object')

In [101]:
# Get info on data types and missing values
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   weight        398 non-null    object
 4   acceleration  398 non-null    float64
 5   model_year    398 non-null    float64
 6   origin        398 non-null    int64
 7   class         398 non-null    int64
 8   car_name      398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

## Summarize values
What is the mean, std, min, max in each column?

In [102]:
# get mean of each column
data.mean()

mpg               23.514573
cylinders          5.454774
displacement     193.425879
acceleration    2970.424623
model_year        15.568090
origin            76.010050
class              1.572864
dtype: float64

In [103]:
# where are the other columns? Check data types
data.dtypes

mpg             float64
cylinders         int64
displacement    float64
weight           object
acceleration    float64
model_year      float64
origin            int64
class             int64
car_name         object
dtype: object

Notice that many columns are of type object, which is not a number. Maybe this has to do with missing values? We know from peeking at the first rows that there are '?' values in there. Let's replace these with the string NaN for not-a-number.

In [104]:
# replace '?' with 'NaN'
data = data.replace({'?': 'NaN'})
data.head()

,mpg,cylinders,displacement,weight,acceleration,model_year,origin,class,car_name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

Pandas knows that 'NaN' probably means that numbers are missing. Now we can convert the data type from object to float

In [106]:
# convert dtypes... only weight column incorrect in auto-mpg dataset
data['weight'] = data['weight'].astype(float)
data.dtypes

mpg             float64
cylinders         int64
displacement    float64
weight          float64
acceleration    float64
model_year      float64
origin            int64
class             int64
car_name         object
dtype: object

We could have loaded the data with the `na_values` argument to indicate that '?' means missing number:

In [111]:
data = pd.read_csv('auto-mpg.data', delim_whitespace=True, header=None, na_values='?')
data.columns= [
    "mpg",
    "cylinders",
    "displacement",
    "weight",
    "acceleration",
    "model_year",
    "origin",
    "class",
    "car_name"
]
data.dtypes

mpg             float64
cylinders         int64
displacement    float64
weight          float64
acceleration    float64
model_year      float64
origin            int64
class             int64
car_name         object
dtype: object

This worked nicely. Now we can describe all columns, meaning printing basic statistics. Note that by default Pandas ignores NaN, whereas Numpy does not.

In [112]:
data.describe() # ignores NaN

,mpg,cylinders,displacement,weight,acceleration,model_year,origin,class
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050,1.572864
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627,0.802055
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000,1.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000,2.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000

We could be interested by these statistics in each of the genders. To get these, we first group values by gender, then ask for the description. We will only look at age for clarity

In [114]:
data.groupby(by='origin').describe().mpg

        count       mean       std   min     25%    50%     75%   max
origin
70       29.0  17.689655  5.339231   9.0  14.000  16.00  22.000  27.0
71       28.0  21.250000  6.591942  12.0  15.500  19.00  27.000  35.0
72       28.0  18.714286  5.435529  11.0  13.750  18.50  23.000  28.0
73       40.0  17.100000  4.700245  11.0  13.000  16.00  20.000  29.0
74       27.0  22.703704  6.420010  13.0  16.000  24.00  27.000  32.0
75       30.0  20.266667  4.940566  13.0  16.000  19.50  23.000  33.0
76       34.0  21.573529  5.889297  13.0  16.750  21.00  26.375  33.0
77       28.0  23.375000  6.675862  15.0  17.375  21.75  30.000  36.0
78       36.0  24.061111  6.898044  16.2  19.350  20.70  28.000  43.1
79       29.0  25.093103  6.794217  15.5  19.200  23.90  31.800  37.3
80       29.0  33.696552  7.037983  19.1  29.800  32.70  38.100  46.6
81       29.0  30.334483  5.591465  17.6  26.600  31.60  34.400  39.1
82       31.0  31.709677  5.392548  22.0  27.000  32.00  36.000  44.0

## Find NaNs
How many NaNs in each column?

We can ask which entries are null, which produces a boolean array

In [115]:
data.isnull()

,mpg,cylinders,displacement,weight,acceleration,model_year,origin,class,car_name
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
393,False,False,False,False,False,False,False,False,False
394,False,False,False,False,False,False,False,False,False
395,False,False,False,False,False,False,False,False,False
396,False,False,False,False,False,False,False,False,False
397,False,False,False,False,False,False,False,False,False

Applying `sum()` to this boolean array will count the number of `True` values in each column

In [116]:
data.isnull().sum()  # 6 null values in weight column

mpg             0
cylinders       0
displacement    0
weight          6
acceleration    0
model_year      0
origin          0
class           0
car_name        0
dtype: int64

We get complementary information from `info()`

In [117]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   weight        392 non-null    float64
 4   acceleration  398 non-null    float64
 5   model_year    398 non-null    float64
 6   origin        398 non-null    int64
 7   class         398 non-null    int64
 8   car_name      398 non-null    object
dtypes: float64(5), int64(3), object(1)
memory usage: 28.1+ KB

We can fill (replace) these missing values, for example with the minimum value in each column

In [118]:
# fill null values with the min of the column
data.fillna(data.min())

,mpg,cylinders,displacement,weight,acceleration,model_year,origin,class,car_name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790.0,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52.0,2130.0,24.6,82,2,vw pickup
395,32.0,4,135.0,84.0,2295.0,11.6,82,1,dodge rampage
396,28.0,4,120.0,79.0,2625.0,18.6,82,1,ford ranger
397,31.0,4,119.0,82.0,2720.0,19.4,82,1,chevy s-10

## Count unique values (a histogram)

We finish off, with our good friend the histogram

In [119]:
data['mpg'].value_counts()

13.0    20
14.0    19
18.0    17
15.0    16
26.0    14
        ..
26.5     1
19.1     1
33.8     1
28.1     1
31.8     1
Name: mpg, Length: 129, dtype: int64